export const INDOOR_CENTERLINES = [
    {
        id: 'main-walkway-1',
        // อาคาร 1 -> 3 -> สนามฟุตซอล
        points: [
            [18.758769, 99.014645], // อาคาร 1
            [18.758564, 99.014887],
            [18.758361, 99.015129], // อาคาร 3
            [18.758158, 99.015113],
            [18.757955, 99.015097], // สนามฟุตซอล
        ],
    },
    {
        id: 'main-walkway-2',
        // อาคาร 2 -> สนามฟุตซอล -> อาคาร 4
        points: [
            [18.758914, 99.015257], // อาคาร 2
            [18.758434, 99.015177],
            [18.757955, 99.015097], // สนามฟุตซอล
            [18.757969, 99.015304],
            [18.757983, 99.015512], // อาคาร 4
        ],
    },
    {
        id: 'secondary-walkway-1',
        // อาคาร 4 -> 5
        points: [
            [18.757983, 99.015512], // อาคาร 4
            [18.758075, 99.015637],
            [18.758168, 99.015763], // อาคาร 5
        ],
    }
];
