export const SHARED_LOCATIONS = [
    { name: "อาคาร 1 อาคารอำนวยการ", lat: 18.758769, lng: 99.014645 },
    { name: "อาคาร 2 อาคารสารสนเทศ", lat: 18.758914, lng: 99.015257 },
    { name: "อาคาร 3 อาคารประถมศึกษา", lat: 18.758361, lng: 99.015129 },
    { name: "อาคาร 4 อาคารมัธยมศึกษาตอนต้น", lat: 18.757983, lng: 99.015512 },
    { name: "อาคาร 5 อาคารอนุบาล สระว่ายน้ำ โรงอาหาร", lat: 18.758168, lng: 99.015763 },
    { name: "อาคาร 6 อาคารพลศึกษา ห้องสภานักเรียน", lat: 18.757394, lng: 99.015381 },
    { name: "อาคาร 7 อาคารมัธยมศึกษาตอนปลาย ห้องสมุด", lat: 18.757590, lng: 99.015905 },
    { name: "สนามฟุตซอล (Futsal)", lat: 18.757955, lng: 99.015097 },
    { name: "สนามหญ้าจริง (Safe Zone)", lat: 18.757826, lng: 99.014679 },
    { name: "สนามบาสเก็ดบอล", lat: 18.757833, lng: 99.015761 },
];

export const SHARED_EDGES = [
    { nameA: "อาคาร 1 อาคารอำนวยการ", nameB: "อาคาร 3 อาคารประถมศึกษา", distance: 50, time: 2 },
    { nameA: "อาคาร 3 อาคารประถมศึกษา", nameB: "สนามฟุตซอล (Futsal)", distance: 40, time: 1 },
    { nameA: "สนามฟุตซอล (Futsal)", nameB: "สนามหญ้าจริง (Safe Zone)", distance: 30, time: 1 },
    { nameA: "อาคาร 2 อาคารสารสนเทศ", nameB: "สนามฟุตซอล (Futsal)", distance: 60, time: 2 },
    { nameA: "อาคาร 1 อาคารอำนวยการ", nameB: "อาคาร 2 อาคารสารสนเทศ", distance: 15, time: 1 },
    { nameA: "อาคาร 2 อาคารสารสนเทศ", nameB: "อาคาร 3 อาคารประถมศึกษา", distance: 45, time: 2 },
    { nameA: "อาคาร 4 อาคารมัธยมศึกษาตอนต้น", nameB: "สนามฟุตซอล (Futsal)", distance: 25, time: 1 },
    { nameA: "อาคาร 5 อาคารอนุบาล สระว่ายน้ำ โรงอาหาร", nameB: "อาคาร 4 อาคารมัธยมศึกษาตอนต้น", distance: 35, time: 1 },
    { nameA: "อาคาร 6 อาคารพลศึกษา ห้องสภานักเรียน", nameB: "สนามหญ้าจริง (Safe Zone)", distance: 55, time: 2 },
    { nameA: "อาคาร 7 อาคารมัธยมศึกษาตอนปลาย ห้องสมุด", nameB: "สนามบาสเก็ดบอล", distance: 40, time: 2 },
];

export const SCHOOL_POLY = [
    [18.759325, 99.014238],
    [18.759477, 99.016395],
    [18.757065, 99.016556],
    [18.756913, 99.014388]
];

export const GATES = [
    { name: "Gate 1 (ทางเข้าหลัก)", lat: 18.758800, lng: 99.014450 },
    { name: "Gate 2 (ทางเข้าอนุบาล)", lat: 18.758300, lng: 99.016000 }
];
